---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyString
source: html/3cb1e5bd-8dd7-8a0b-18c2-3b15c113bfb2.htm
---
# AssetPropertyString Methods

Adds a new connected asset attached to this asset property, if it allows it.